---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WallType
source: html/0e6a4c5a-06f3-0608-b92b-7a3a84d7bd18.htm
---
# WallType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.